app/controllers/items_controller.rb

  def new
#    extension_type = ExtensionType.find(params[:item][:extension_type_id])
#    @item = Item.new
#    @item.block_id = params[:block]
#    @item.extension_type_id = extension_type.id
#    @item.user_id = current_user
#    @item.status = Status.find_by_name("Development")
    tmpitems = @item.block.items
    if !tmpitems.nil? && tmpitems.length > 0
---
SELECT * FROM `items` WHERE (`items`.block_id = 2) ORDER BY items.order DESC