app/controllers/menus_controller.rb

  def show
    @menu = Menu.find(params[:id])
---
SELECT * FROM `menus` WHERE (`menus`.`id` = 1)

  def create
    @menu = Menu.new(params[:menu])

    @item = session[:item]
    @item.resource = @menu
    respond_to do |format|
      if @item.save
        flash[:notice] = t('message.menu.created')
        format.html { redirect_to @item.block.page.get_page_path }
---
INSERT INTO `items` (`resource_type`, `extension_type_id`, `updated_at`, `block_id`, `order`, `resource_id`, `connector`, `status_id`, `user_id`, `created_at`) VALUES('Menu', 1, '2009-11-14 21:48:31', 2, 1, 1, 1, 3, 1, '2009-11-14 21:48:31')
INSERT INTO `menus` (`menu_type_id`, `updated_at`, `depth`, `created_at`) VALUES(4, '2009-11-14 21:48:31', 1, '2009-11-14 21:48:31')
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)

  def update
    @menu = Menu.find(params[:id])

    respond_to do |format|
      if @menu.update_attributes(params[:menu])
---
SELECT * FROM `menus` WHERE (`menus`.`id` = 1)
UPDATE `menus` SET `menu_type_id` = 1, `depth` = 0, `updated_at` = '2009-11-14 23:37:08' WHERE `id` = 1