app/controllers/pages_controller.rb

SELECT * FROM `languages` WHERE (`languages`.`short_name` = 'PL') LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.parent_id = 1) ORDER BY pages.order DESC
SELECT * FROM `languages` WHERE (`languages`.`id` = 1)
SELECT * FROM `layout_templates` WHERE (`layout_templates`.`id` = 1)
SELECT * FROM `positions` WHERE (`positions`.layout_template_id = 1 AND (main_position = 1)) LIMIT 1
SELECT * FROM `blocks` WHERE (`blocks`.page_id = 1 AND (position_id = 1)) LIMIT 1
SELECT * FROM `items` WHERE (`items`.block_id = 1) ORDER BY items.order DESC
SELECT * FROM `items` WHERE (`items`.block_id = 1) ORDER BY "order" DESC, items.order DESC LIMIT 0, 1
SELECT * FROM `layout_templates`
SELECT * FROM `pages` LIMIT 1
---
  def show
    unless params[:id].nil?
      @page = Page.find_by_param(params[:id])
      @ok = true
    else
      unless params[:name].nil? && params[:language].nil?
        session[:language] = Language.find_by_short_name(params[:language])
        #       @page = Page.find_by_param_and_language_id(params[:name], session[:language].id)
        @page = Page.find_by_param(params[:name], :conditions => ["language_id = ?", session[:language].id])
        @ok = true
      else
        @page = Page.find(:first)
        @ok = false
      end
    end
    if session[:language].nil?
      session[:language] = Language.find(:first)
    end
# Blog controller rendering is disabled
#    if @page.is_blog and false
#      redirect_to :controller => 'pages', :action => 'blog', :user => User.find(@page.user_id).login, :language => session[:language].short_name and true
#    else
      unless @page.nil?
        @main_position = @page.layout_template.positions.find(:first, :conditions => ["main_position = 1"])
        @items = @page.blocks.find(:first, :conditions => ["position_id = ?",@main_position.id]).items
        if @main_position.page_pagination > 0 and !@items.nil?
          @items = @items.paginate :page => params[:page], :per_page => @main_position.page_pagination, :order => '"order" DESC'

SELECT * FROM `languages` WHERE (`languages`.`short_name` = 'pl') LIMIT 1
---
  def tag
    @items = PlainText.find_tagged_with(params[:tag])

    if params[:language].nil?
      session[:language] = Language.find(:first)
    else
      session[:language] = Language.find_by_short_name(params[:language])

SELECT * FROM `pages` WHERE (slug = 'home') LIMIT 1
SELECT * FROM `positions` WHERE (`positions`.layout_template_id = 1)
INSERT INTO `blocks` (`updated_at`, `page_id`, `position_id`, `created_at`) VALUES('2009-11-14 21:44:12', 1, 1, '2009-11-14 21:44:12')
INSERT INTO `pages` (`name`, `slug`, `layout_template_id`, `updated_at`, `is_blog`, `order`, `page_type`, `language_id`, `connector`, `description`, `status_id`, `user_id`, `parent_id`, `created_at`, `redirect`) VALUES('home', 'home', 1, '2009-11-14 21:44:12', 0, 1, NULL, 1, 1, '', 1, NULL, NULL, '2009-11-14 21:44:12', NULL)
SELECT * FROM `layout_templates` WHERE (`layout_templates`.`id` = 1)
SELECT * FROM `languages` WHERE (`languages`.`short_name` = 'pl') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def create
    unless params[:page][:type].nil?
      object = Object.const_get(params[:page][:type])
      @page = object.new(params[:page])
    else
      @page = Page.new(params[:page])
    end

    @page.layout_template.positions.each{|p|
      @page.blocks << Block.new(:page_id => @page.id, :position_id => p.id)
    }

    @page.slug = Page.escape_permalink(@page.name,"-")
    existing_pages = Page.find(:first, :conditions => ["slug = ?", @page.slug])
    if @page.parent.nil? || @page.parent.children.size == 0
      @page.order = 1
    else
      @page.order = @page.parent.children.size + 1
    end

    respond_to do |format|
      if existing_pages.nil? and @page.save
        flash[:notice] = t('message.page.created')
        if @page.type == "Blog"
          format.html { redirect_to :controller => 'blogs', :action => 'show', :user => User.find(@page.user_id).login, :language => session[:language].short_name and return}

SELECT * FROM `pages` WHERE (slug = 'blog') LIMIT 1
---
  def find_page
    @page = Page.find(params[:id])