app/controllers/positions_controller.rb

SELECT * FROM `positions` WHERE (`positions`.`id` = 1)
---
  def edit
    @position = Position.find(params[:id])

SELECT * FROM `positions` WHERE (`positions`.`id` = 1)
UPDATE `positions` SET `page_pagination` = 1, `updated_at` = '2009-11-14 16:24:29' WHERE `id` = 1
---
  def change_pagination
    @position = Position.find(params[:id])
    errors = []
    page_pagination_tmp = @position.page_pagination
    if @position.main_position
      @position.page_pagination = params[:pagination]
      if @position.save