app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 1 )
---
  def delete
    @user = User.find(params[:id])
    user_id = @user.id
    if User.count == 1 || Role.find(:first, :conditions => ["name = 'admin'"]).users.count <= 1 and @user.roles.any?{|role| role.name.eql?("admin") }